import numpy as np

print("#############################创建一维数组#############################")
arr1 = np.array([1, 2, 3, 4, 5])
print(arr1)

print("#############################创建二维数组#############################")
arr2 = np.array([[1, 2, 3], [4, 5, 6]])
print(arr2)

print("#############################创建一个 2x3 的数组，元素全为 0#############################")
arr = np.zeros((2, 3))
print(arr)

print("#############################创建一个 2x3 的数组，元素全为 1#############################")
arr = np.ones((2, 3))
print(arr)
print("#############################创建一个 2x3 的数组，元素全为 7#############################")
arr = np.full((2, 3), 7)
print(arr)
print("#############################创建一个 3x3 的单位矩阵#############################")
arr = np.eye(3)
print(arr)
print("#############################创建一个从 0 到 10（不包括 10）的数组，步长为 2#############################")
arr = np.arange(0, 10, 2)
print(arr)
print("#############################创建一个从 0 到 1 的数组，包含 5 个元素#############################")
arr = np.linspace(0, 1, 5)
print(arr)
print("#############################从已有的列表或元组创建数组。#############################")
arr = np.array([1, 2, 3, 4, 5])
print(arr)
print("#############################将输入转换为数组。#############################")
arr = np.asarray([1, 2, 3, 4, 5])
print(arr)

print("############################# 索引 #############################")

arr = np.array([1, 2, 3, 4, 5])

# 一维数组索引
print(arr[0])  # 输出 1
print(arr[-1])  # 输出 5

arr2 = np.array([[1, 2, 3], [4, 5, 6]])

# 二维数组索引
print(arr2[0, 0])  # 输出 1
print(arr2[1, 2])  # 输出 6

print("############################# 切片 #############################")

arr = np.array([1, 2, 3, 4, 5])

# 一维数组切片
print(arr[1:4])  # 输出 [2 3 4]

arr2 = np.array([[1, 2, 3], [4, 5, 6]])

# 二维数组切片
print(arr2[0, :])  # 输出 [1 2 3]
print(arr2[:, 1])  # 输出 [2 5]

print("############################# 形状操作 #############################")
arr = np.array([1, 2, 3, 4, 5, 6])
arr_reshaped = arr.reshape((2, 3))  # 将一维数组重塑为 2x3 的二维数组
print(arr_reshaped)

arr = np.array([[1, 2, 3], [4, 5, 6]])
arr_flattened = arr.flatten()  # 将二维数组展平为一维
print(arr_flattened)

arr = np.array([[1, 2, 3], [4, 5, 6]])
arr_transposed = arr.transpose()  # 将数组的行和列互换
print(arr_transposed)